NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TDM_NS">
      <name>GLOBAL_TDM_S</name>
      <description>Time division multiplexed audio interface 1</description>
      <baseAddress>0x500E8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TDM</name>
        <value>232</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM23_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 8</description>
      <baseAddress>0x400ED000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS23_NS</name>
      <description>SPI Slave 8</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM23_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 6</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS23_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 6</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE23_NS</name>
      <description>UART with EasyDMA 8</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM23_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 9</description>
      <baseAddress>0x500ED000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS23_S</name>
      <description>SPI Slave 9</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM23_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 7</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS23_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 7</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE23_S</name>
      <description>UART with EasyDMA 9</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM24_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 10</description>
      <baseAddress>0x400EE000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS24_NS</name>
      <description>SPI Slave 10</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM24_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 8</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS24_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 8</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE24_NS</name>
      <description>UART with EasyDMA 10</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM24_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 11</description>
      <baseAddress>0x500EE000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
